interface ISlide {
  id: number;
  content: string;
}

export const onboardingData: ISlide[] = [
  {
    id: 1,
    content: '저희 ‘선따라 길따라’ 서비스가 처음이시라고요? \n제가 사용법을 알려드릴게요!',
  },
  {
    id: 2,
    content: '채널을 생성하고 싶으시다면, \n회원가입 후 로그인을 해주세요!',
  },
  {
    id: 3,
    content:
      '로그인 후 본인이 생성해둔 채널들을 확인할 수 있습니다! \n공유하기를 눌러 게스트 별로 링크를 확인할 수도 있어요!',
  },
  {
    id: 4,
    content: '그럼 이제, + 버튼을 눌러 채널을 만들어볼까요?',
  },
  {
    id: 5,
    content: '채널의 제목과 게스트도 \n최대 5명까지 입력 가능합니다!',
  },
  {
    id: 6,
    content:
      '하늘색 버튼을 누르면, 게스트별로 (할머니, 할아버지....)\n출발지, 도착지, 경로를 직접 그려줄 수 있어요!',
  },
  {
    id: 7,
    content: '그럼 이제, 출발지와 도착지를 먼저 설정해볼까요?',
  },
  {
    id: 8,
    content:
      '1번 버튼을 누르면 검색도 가능하고, \n2번에서처럼 마커를 직접 터치로 찍을 수도 있어요!',
  },
  {
    id: 9,
    content: '그럼 이제 경로를 그려볼까요?',
  },
  {
    id: 10,
    content: '경로는 이렇게 직선 형태로 이어집니다! \n터치를 통해 직선을 이어서 경로를 그려보세요!',
  },
  {
    id: 11,
    content: '이렇게 출발지와 도착지를 이어주면 되겠죠?',
  },
  {
    id: 12,
    content: '모든 사용자에 대한 정보를 입력했다면, \n제작 완료 버튼을 눌러주세요!',
  },
  {
    id: 13,
    content:
      '이제 할머니께 링크를 공유해드리면, \n그려둔 경로와 할머니의 실시간 위치를 볼 수 있습니다!',
  },
  {
    id: 14,
    content: '채널을 만든 사람은 이렇게모든 게스트들의 \n경로와 현재 위치도 한 번에 볼 수 있어요!',
  },
  {
    id: 15,
    content: '이제 우리의 캐릭터들과 함께 \n길 안내 서비스를 시작해볼까요?',
  },
];
